Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Примеры. Расчет стоимости доставки
en: Examples. Calculating delivery cost

source: Круг может быть создан с помощью класса Circle.
en: A circle can be created using the Circle class.

source: При создании круга необходимо указать координаты его центра, а также радиус (в метрах). Также могут быть заданы свойства (например, содержимое его балуна или хинта) и опции (например, цвет его заливки) круга.
en: When creating a circle, you must specify the coordinates of its center and radius (in meters). You can also set properties (such as the contents of the balloon or hint) and options (such as the fill color) for the circle.

source: Круги можно объединять в коллекции.
en: Circles can be combined in a collection.

source: Создаем круг.
en: Creating a circle.

source: Координаты центра круга.
en: The coordinates of the center of the circle.

source: Радиус круга в метрах.
en: The radius of the circle in meters.

source: Описываем свойства круга. Содержимое балуна.
en: Describing the properties of the circle. The contents of the balloon.

source: Задаем опции круга. Включаем возможность перетаскивания круга.
en: Setting the circle options. Enabling drag-n-drop for the circle.

source: Цвет заливки. Последний байт (77) определяет прозрачность. Прозрачность заливки также можно задать используя опцию "fillOpacity".
en: Fill color. The last byte (77) defines transparency. The transparency of the fill can also be set using the option "fillOpacity".

source: Ширина обводки в пикселях.
en: The width of the stroke in pixels.

source: Добавляем круг на карту.
en: Adding the circle to the map.

source: Примеры. Круг
en: Examples. Circle

source: Если мы не хотим, чтобы контур был виден, зададим соответствующую опцию.
en: If we do not want the outline to be visible, we set the appropriate option.

source: Чтобы корректно осуществлялись геометрические операции над спроецированным многоугольником, его нужно добавить на карту.
en: To correctly carried out geometric operations on the projected polygon, you must add it to the map.

source: Объединим в выборку все сегменты маршрута.
en: Combining all the route segments in a selection.

source: Переберем все сегменты и разобьем их на отрезки.
en: Iterating all the segments and dividing them into sections.

source: Создадим новую выборку, содержащую:
en: Creating a new selection, containing:

source: отрезки, описываюшие маршрут;
en: sections that define the route;

source: начальную и конечную точки;
en: the start and end points;

source: промежуточные точки.
en: intermediate points.

source: Найдем все объекты, попадающие внутрь МКАД.
en: Finding all the objects that fall inside the ring road.

source: Найдем объекты, пересекающие МКАД.
en: Finding the objects that intersect with the ring road.

source: Раскрасим в разные цвета объекты внутри, снаружи и пересекающие МКАД.
en: Using different colors for objects inside, outside and intersecting the ring road.

source: Объекты за пределами МКАД получим исключением полученных выборок из исходной.
en: We will get objects outside the ring road by excluding resulting selections from the source selection.

source: Примеры. Пересечение маршрута с многоугольником на примере МКАД.
en: Examples. The intersection of a route with a polygon using the example of the Moscow Ring Road.

source: Маршрут внутри МКАД помечен красным, снаружи - синим
en: The route inside the ring road is marked in red, and outside is blue

source: Геообъекты можно объединять в коллекции. Вы можете создавать коллекции для групповых операций над геообъектами. Например, можно подписываться на события объектов или задавать им опции.
en: Geo objects can be grouped into collections. You can create collections for group operations on geo objects. For example, you can subscribe to events of objects or set their options.

source: Примеры. Добавление геообъектов в коллекцию
en: Examples. Adding geo objects to a collection

source: Через коллекции можно подписываться на события дочерних элементов.
en: You can subscribe to events of child elements via a collection.

source: Через коллекции можно задавать опции дочерним элементам.
en: You can set options for child elements via a collection.

source: С помощью класса [#$dp8] можно формировать набор меток на карте из JSON-описаний их геометрий.
en: Using the [#$dp8] class, you can create a set of placemarks on the map from JSON-descriptions of their geometries.

source: Метод search позволяет фильтровать объекты выборки по различным признакам. Например выбирать объекты с определенным значением полей данных или выбирать объекты по типу геометрии.
en: The search method allows you to filter the objects in the selection according to various criteria. For example, to select objects with a specific value in data fields or select objects based on the geometry type.

source: В данном примере показано, как осуществлять выборку геообъектов по нескольким признакам, делать объединение или пересечение выборок.
en: This example shows how to select geo objects by multiple characteristics, and make a combination or a sample of the selection.

source: Функция, которая по состоянию чекбоксов в меню показывает или скрывает геообъекты из выборки.
en: A function, which according to the state of the checkboxes in the menu shows or hides the geo objects from the selection.

source: Отберем объекты по цвету.
en: Selecting objects by color.

source: Будем искать по двум параметрам:
en: We will search using two parameters:

source: для точечных объектов по полю preset;
en: for point objects using the "preset" field;

source: для контурных объектов по цвету заливки.
en: for contour objects using the fill color.

source: После того, как мы нашли все зеленые объекты, добавим к ним объекты, найденные на предыдущей итерации.
en: After we have found all the green objects, we will add them to the objects found in the previous iteration.

source: Отберем объекты по форме.
en: Selecting objects based on shape.

source: Мы отобрали объекты по цвету и по форме. Покажем на карте объекты, которые совмещают нужные признаки.
en: We selected objects by color and shape. Now we'll show objects on the map that combine the desired characteristics.

source: Объекты, которые не попали в выборку, нужно убрать с карты.
en: Objects that were not included in the selection must be removed from the map.

source: Создадим объекты из их JSON-описания и добавим их на карту.
en: Creating objects from their JSON descriptions and adding them to the map.

source: Примеры. Фильтрация объектов по признакам.
en: Examples. Filtering objects by attributes.

source: Создадим пользовательский макет ползунка масштаба.
en: Creating a custom layout for the zoom slider.

source: Переопределяем методы макета, чтобы выполнять дополнительные действия при построении и очистке макета.
en: Redefining methods of the layout, in order to perform additional steps when building and clearing the layout.

source: Вызываем родительский метод build.
en: Calling the "build" parent method.

source: Привязываем функции-обработчики к контексту и сохраняем ссылки на них, чтобы потом отписаться от событий.
en: Binding handler functions to the context and storing references to them in order to unsubscribe from the event later.

source: Начинаем слушать клики на кнопках макета.
en: Beginning to listen for clicks on the layout buttons.

source: Снимаем обработчики кликов.
en: Removing click handlers.

source: Вызываем родительский метод clear.
en: Calling the "clear" parent method.

source: Генерируем событие, в ответ на которое элемент управления изменит коэффициент масштабирования карты.
en: Generating an event, in response to which the control will change the map zoom.

source: Примеры. Пользовательский макет элемента изменения масштаба.
en: Examples. Custom layout for the zoom control.

source: Каждому географическому объекту в YMapsML ставятся в соответствие геометрическая фигура и геообъект, используемый для отображения этой фигуры на карте. Описание фигур и их привязка к географическим координатам задается в соответствующих YMapsML-элементах. Для фигуры "ломаная линия" предназначен элемент gml:LineString. Он содержит координаты вершин линии.
en: In YMapsML, each geographical object is associated with a geometric shape and a geo object that is used for displaying this shape on the map. The shape definitions and their anchors to geographical coordinates are set in corresponding YMapsML elements. The gml:LineString element is designated for the "polyline" shape. This element contains the coordinates of line endpoints.

source: Для загрузки YMapsML-данных предназначена функция [#$dp14]. После того как данные загрузятся, функция преобразует их в [#$dp15] и передает в качестве параметра функции-обработчику. Коллекцию геообъектов GeoObjectCollection можно отобразить на карте.
en: The [#$dp14] function is for loading YMapsML data. After data has loaded, the function converts the data to [#$dp15] and passes it to the handler function as a parameter. A GeoObjectCollection can be displayed on the map.

source: Добавление коллекции геообъектов на карту.
en: Adding geo object collections to the map.

source: Внешний вид отображаемых объектов задается в элементе repr:Representation.
en: The appearance of the displayed objects is set in the repr:Representation.

source: Для загрузки YMapsML-данных предназначена функция [#$dp17]. После того как данные загрузятся, функция преобразует их в коллекцию геообъектов [#$dp18] и затем передает ее в качестве параметра функции-обработчику. Коллекцию GeoObjectCollection можно отобразить на карте.
en: The [#$dp17] function is for loading YMapsML data. After data has loaded, the function converts the data to [#$dp18] and then passes it to the handler function as a parameter. A GeoObjectCollection can be displayed on the map.

source: Примеры YMapsML. Смена значка у метки.
en: YMapsML examples. Changing a placemark icon.

source: Элемент управления «поиск по карте» умеет находить топонимы, размещенные на обычной или народной карте. Но часто необходимо найти не определенный топоним, а какую-либо организацию. Например: кафе, ресторан или магазин.
en: The "Search on map" control can find toponyms on the normal or public map. But it is often necessary to find a business, instead of a specific toponym. For example, a cafe, restaurant, or store.

source: Чтобы научить элемент управления искать организации, необходимо подключить определенный провайдер данных — «yandex#search». Рассмотрим на примере, как это сделать.
en: To teach the control to search for organizations, you must enable a specific data provider — "yandex#search". Let's look at examples of how to do this.

source: Создадим экземпляр элемента управления «поиск по карте», с установленной опцией провайдера данных для поиска по организациям.
en: Creating an instance of the "search on map" control, with the data provider for searching by organizations set.

source: Программно выполним поиск кафе в текущей прямоугольной области карты.
en: Programmatically searching for a cafe in the current rectangular map area.

source: Примеры. Адаптивный пользовательский макет кнопки в API 2.1
en: Examples. Adaptive custom button layout in the API 2.1

source: Возможные значения цветов иконок.
en: Possible values for icon colors.

source: Устанавливаем стандартный макет балуна кластера "Аккордеон".
en: Setting the "Accordion" standard layout for a cluster balloon.

source: Можно отключить отображение иконок геообъектов в списке. В браузере Internet Explorer ниже 9й версии иконки никогда не будут отображаться. clusterBalloonAccordionShowIcons: false
en: You can disable displaying icons for geo objects in the list. In Internet Explorer earlier than version 9, icons are never displayed. clusterBalloonAccordionShowIcons: false

source: Примеры. Собственный макет информации о геообъекте в макете балуна кластера "Аккордеон".
en: Examples. Custom layout for information about a geo object in the "Accordion" layout of the cluster balloon.

source: Балун можно отображать в пейне, границы которого выходят за пределы карты. Это удобно, когда карта маленького размера, но в балуне нужно отобразить большое количество информации.
en: The balloon can be displayed in a pane with boundaries that go off the map. This is useful when the map is small, but the balloon needs to display a large amount of information.

source: В этом примере дополнительно к использованию опции отображения балуна во внешнем пейне установлено слежение за текущим положением точки привязки, в момент перемещения которой за пределы видимой области карты, балун снова помещается во внутренний пейн.
en: In this example, in addition to using options for displaying a balloon in an external pane, tracking is enabled for the current position of the anchor point, which when moved outside the visible area of the map, the balloon once again fits inside the internal pane.

source: Примеры. Балун, выходящий за пределы карты
en: Examples. A balloon that goes off the map

source: При открытии балуна начинаем слушать изменение центра карты.
en: When opening a balloon, begin to listen for a change to the center of the map.

source: Вызываем функцию в двух случаях:
en: Calling a function in two cases:

source: 1) в начале движения (если балун во внешнем контейнере);
en: 1) in the beginning of the movement (if the balloon is in an external container);

source: 2) в конце движения (если балун во внутреннем контейнере).
en: 2) at the end of the movement (if the balloon is in the internal container).

source: Вызываем функцию сразу после открытия.
en: Calling the function immediately after opening.

source: При закрытии балуна удаляем слушатели.
en: When closing a balloon, we remove listeners.

source: Используется при изменении зума.
en: Used when changing the zoom.

source: Определяем, попадает ли точка привязки балуна в видимую область карты.
en: Determining whether the anchor point of a balloon is in the visible area of the map.

source: Если точка привязки не попадает в видимую область карты, переносим балун во внутренний контейнер
en: If the anchor does not fall within the visible area of the map, we move the balloon into the inner container

source: и наоборот.
en: and the reverse.

source: Примеры YMapsML. Наследование стилей.
en: YMapsML examples. Style inheritance.

source: Внешний вид отображаемых объектов задается в элементе repr:Representation. В документации можно ознакомиться с подробной инструкцией по заданию стиля отображаемых объектов.
en: The visual appearance of displayed objects is set in the repr:Representation element. For detailed instructions on setting styles for displayed objects, see the documentation.

source: С помощью стилей можно изменить параметры стандартного представления геообъектов. Например, можно задать толщину линий ломаных или цвет заливки многоугольника.
en: You can use styles to change parameters for the standard representation of geo objects. For example, you can set the line width for polylines or the fill color for polygons.

source: Примеры YMapsML. Подгрузка стилей из отдельного файла.
en: YMapsML Examples. Loading styles from a separate file.

source: Вызывается в случае неудачной загрузки стилей.
en: Called if loading styles was unsuccessful.

source: Примеры. Собственный элемент управления.
en: Examples. Custom control.

source: Пример реализации собственного элемента управления на основе наследования от collection.Item. Элемент управления отображает название объекта, который находится в центре карты.
en: An example implementation of a custom control based on inheritance from collection.Item. The control displays the name of the object that is in the center of the map.

source: Создаем собственный класс.
en: Creating a custom class.

source: И наследуем его от collection.Item.
en: And inheriting it from the collection.Item.

source: Создаем HTML-элемент с текстом.
en: Creating an HTML element with the text.

source: Запрашиваем данные после изменения положения карты.
en: Requesting data after changing the position of the map.

source: Сразу же запрашиваем название места.
en: Immediately requesting the name of the place.

source: Запрашиваем информацию о месте по координатам центра карты.
en: Requesting information about the place by the coordinates of the map center.

source: Указываем, что ответ должен быть в формате JSON.
en: Specifying that the response should be in JSON format.

source: Устанавливаем лимит на кол-во записей в ответе.
en: Setting a limit on the number of records in the response.

source: Будем обрабатывать только ответ от последнего запроса.
en: We will only process the response from the last request.

source: Данные от сервера были получены и теперь их необходимо отобразить. Описание ответа в формате JSON.
en: The data has been received from the server and now it must be displayed. Description of the response in JSON format.

source: Шаблоны позволяют сформировать произвольное HTML-представление геообъектов, балунов и хинтов.
en: Templates allow you to make custom HTML representations of geo objects, balloons, and hints.

source: Для определения шаблона используется элемент repr:Representation, внутри которого в контейнере repr:text размещается HTML-код (тело шаблона).
en: To define a template, use the repr:Representation element, which contains the HTML code (the template body) in the repr:text container.

source: При использовании шаблона доступ к значению любого XML-элемента, находящегося внутри элемента ymaps:GeoObject или ymaps:GeoObjectCollection, осуществляется с помощью обращения к соответствующей переменной.
en: When using a template, access to the value of any XML element located inside the ymaps:GeoObject or ymaps:GeoObjectCollection element requires accessing the corresponding substitution variable.

source: Для определения переменной используется строка вида $[имя_переменной|значение_по_умолчанию]. Имя переменной представляет собой местоположение этого XML-элемента внутри элемента, к которому применяется стиль. Местоположение задаётся последовательным перечислением названий всех родительских элементов и названия самого элемента, в качестве разделителя используется точка.
en: To define a substitution, use a string in the format $[substitution_name]|default_value]. The substitution name is the location of this XML element inside the element that the style is applied to. The location is defined using an ordered list of the names of all parent elements and the name of the element itself. A dot is used as the separator.

source: Подробнее о шаблонах см. в документации.
en: For more information about templates, see the documentation.

source: Примеры YMapsML. Отображение HTML-содержимого в балуне.
en: YMapsML examples. Displaying HTML content in a balloon.

source: Создание экземпляра карты
en: Creating a map instance

source: Загрузка YMapsML-файла
en: Loading a YMapsML file

source: Метки с текстом ('islands#icon');
en: placemarks with text ('islands#icon');

source: метки, тянущиеся под текст ('islands#stretchyIcon');
en: placemarks that stretch to fit the text ('islands#stretchyIcon');

source: метки с точкой в центре ('islands#dotIcon');
en: placemarks with a dot in the center ('islands#dotIcon');

source: метки в виде кругов ('islands#circleIcon');
en: placemarks in the form of circles ('islands#circleIcon');

source: метки в виде кругов с точкой в центре ('islands#circleDotIcon').
en: placemarks in the form of circles with a dot in the center ('islands#circleDotIcon').

source: Обратите внимание, что в API 2.1 по умолчанию карта создается с элементами управления. Если вам не нужно их добавлять на карту, в ее параметрах передайте пустой массив в поле controls.
en: Please note that in the API 2.1, the map is created with controls by default. If you don't need to add them to the map, pass an empty array in the "controls" field in its parameters.

source: Примеры. Метка и балун-панель.
en: Examples. Placemark and balloon panel.

source: API позволяет определять координаты объекта по его названию (прямое геокодирование) и название объекта по его координатам (обратное геокодирование).
en: The API can determine the coordinates of an object by its name (forward geocoding) and the name of an object by its coordinates (reverse geocoding).

source: Оба вида геокодирования производятся с помощью функции [#$dp11]. Результат, возвращаемый этой функцией, может быть сразу размещён на карте.
en: Both types of geocoding use the [#$dp11] function. The result returned by this function may be immediately placed on the map.

source: В данном примере используется прямое геокодирование: чтобы на карте отметить Нижний Новгород, определяются координаты его центра, после чего на карту добавляется метка с найденными координатами.
en: This example uses forward geocoding: to mark Nizhny Novgorod on the map, we determine the coordinates of its center, and then add a placemark with the found coordinates to the map.

source: Пример иллюстрирует работу с возвращаемыми геокодером данными: как добавлять их на карту или, например, как извлечь необходимую информацию о найденном объекте.
en: The example shows how to work with data returned by the geocoder: how to add it to the map or, for example, how to extract the necessary information about an object.

source: Поиск координат центра Нижнего Новгорода.
en: Find coordinates of the center of Nizhny Novgorod.

source: boundedBy: myMap.getBounds(), // Сортировка результатов от центра окна карты strictBounds: true, // Вместе с опцией boundedBy будет искать строго внутри области, указанной в boundedBy
en: boundedBy: myMap.getBounds(), // Sorting the results from the center of the map window strictBounds: true, // Together with the boundedBy option, the search will be strictly inside the area specified in boundedBy

source: Выбираем первый результат геокодирования.
en: Selecting the first result of geocoding.

source: Координаты геообъекта.
en: The coordinates of the geo object.

source: Область видимости геообъекта.
en: The viewport of the geo object.

source: Добавляем первый найденный геообъект на карту.
en: Adding first found geo object to the map.

source: Масштабируем карту на область видимости геообъекта.
en: Scaling the map to the geo object viewport.

source: Все данные в виде javascript-объекта.
en: All data in the form of a javascript object.

source: Метаданные запроса и ответа геокодера.
en: The metadata of the request and geocoder response.

source: Метаданные геокодера, возвращаемые для найденного объекта.
en: Metadata of the geocoder returned for the found object.

source: Точность ответа (precision) возвращается только для домов.
en: The accuracy of the response (precision) is only returned for houses.

source: Тип найденного объекта (kind).
en: The type of found object (kind).

source: Если нужно добавить по найденным геокодером координатам метку со своими стилями и контентом балуна, создаем новую метку по координатам найденной и добавляем ее на карту вместо найденной.
en: To add a placemark with its own styles and balloon content at the coordinates found by the geocoder, create a new placemark at the coordinates of the found placemark and add it to the map in place of the found one.

source: Примеры. Создание карты с местоположением пользователя
en: Examples. Creating a map with the user's location

source: Рассчитываем видимую область для текущей положения пользователя.
en: Calculating the viewport for the user's current location.

source: Если место положение невозможно получить, то просто создаем карту.
en: If the location cannot be obtained, we just create a map.
